In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('emp_dept.csv')
df

    EMPNO   ENAME        JOB     MGR        DOJ   SAL    COMM  DEPTNO SEX
0    7839    KING  PRESIDENT     NaN  17-Nov-81  6000  1100.0      10   M
1    7698   BLAKE    MANAGER  7839.0  01-May-81  3850     NaN      30   M
2    7782   CLARK    MANAGER  7839.0  09-Jun-81  2000     NaN      10   M
3    7566   MARRY    MANAGER  7839.0  02-Apr-81  3975     NaN      20   F
4    7788   SCOTT    ANALYST  7566.0  19-Apr-87  4000     NaN      20   M
5    7902    FORD    ANALYST  7566.0  03-Dec-81  4000     NaN      20   M
6    7369   SMITH      CLERK  7902.0  17-Dec-80  1800     NaN      20   M
7    7499   ALLEN   SALESMAN  7698.0  20-Feb-81  2600   300.0      30   F
8    7521    WARD   SALESMAN  7698.0  22-Feb-81  2250   500.0      30   F
9    7654  MARTIN   SALESMAN  7698.0  28-Sep-81  2250  1400.0      30   F
10   7844  TURNER   SALESMAN  7698.0  08-Sep-81  2500     0.0      30   F
11   7876   ADAMS      CLERK  7788.0  23-May-87  2100     NaN      20   F
12   7900   JAMES      CLERK  7698.0  03-Dec-81  1950     NaN      30   M
13   9900   VIANY      CLERK  7698.0  03-Dec-81  1950     NaN      50   M